# Introdução

Aqui temos dados dos bilionarios, com ele iremos inicialmente ver a distribuição de riqueza por industria e sexo.

### Importando bibliotecas
Primeiramente devemos importar as bibliotecas que iremos usar como o pandas que usaremos para ler e manipular os dados.

In [2]:
import pandas as pd

### Iendo o arquivo
Depois de importar o pandas fazemos a leitura do arquivo Billionaires Statistics Dataset.csv

In [4]:
df = pd.read_csv('Billionaires Statistics Dataset.csv')

### Impressão dos dados
Imprimiremos as primeiros 5 linhas, assim dando uma analize inicial dos dados.

In [5]:
df.head()

,rank,finalWorth,category,personName,age,country,city,source,industries,countryOfCitizenship,...,cpi_change_country,gdp_country,gross_tertiary_education_enrollment,gross_primary_education_enrollment_country,life_expectancy_country,tax_revenue_country_country,total_tax_rate_country,population_country,latitude_country,longitude_country
0,1,211000,Fashion & Retail,Bernard Arnault & family,74.0,France,Paris,LVMH,Fashion & Retail,France,...,1.1,"$2,715,518,274,227",65.6,102.5,82.5,24.2,60.7,67059887.0,46.227638,2.213749
1,2,180000,Automotive,Elon Musk,51.0,United States,Austin,"Tesla, SpaceX",Automotive,United States,...,7.5,"$21,427,700,000,000",88.2,101.8,78.5,9.6,36.6,328239523.0,37.090240,-95.712891
2,3,114000,Technology,Jeff Bezos,59.0,United States,Medina,Amazon,Technology,United States,...,7.5,"$21,427,700,000,000",88.2,101.8,78.5,9.6,36.6,328239523.0,37.090240,-95.712891
3,4,107000,Technology,Larry Ellison,78.0,United States,Lanai,Oracle,Technology,United States,...,7.5,"$21,427,700,000,000",88.2,101.8,78.5,9.6,36.6,328239523.0,37.090240,-95.712891
4,5,106000,Finance & Investments,Warren Buffett,92.0,United States,Omaha,Berkshire Hathaway,Finance & Investments,United States,...,7.5,"$21,427,700,000,000",88.2,101.8,78.5,9.6,36.6,328239523.0,37.090240,-95.712891

### Visão geral
Olhando pela primeira vez pode-se notar que a quantidade total de colunas não pode ser vista devido a quantidade, tendo isso em vista, iremos ver a quantidade total de colunas e linhas, e o nome das colunas.

In [10]:
print('Quantidade de colunas:\t',df.shape[1],'\nQuantidade de linhas:\t',df.shape[0])

Quantidade de colunas:	 35
Quantidade de linhas:	 2640

In [11]:
df.columns

Index(['rank', 'finalWorth', 'category', 'personName', 'age', 'country',
       'city', 'source', 'industries', 'countryOfCitizenship', 'organization',
       'selfMade', 'status', 'gender', 'birthDate', 'lastName', 'firstName',
       'title', 'date', 'state', 'residenceStateRegion', 'birthYear',
       'birthMonth', 'birthDay', 'cpi_country', 'cpi_change_country',
       'gdp_country', 'gross_tertiary_education_enrollment',
       'gross_primary_education_enrollment_country', 'life_expectancy_country',
       'tax_revenue_country_country', 'total_tax_rate_country',
       'population_country', 'latitude_country', 'longitude_country'],
      dtype='object')

### Simplificando o Data Frame
Para responder a nossa questão inicial não precisamos de algumas colunas como: 'latitude_country', 'longitude_country', pois, elas indicão longitude e latitude, Alem de outras colunas que não usaremos inicialmente. Essa simplificação sera chamada **df_simple**. 

Para fazer isso seguiremos os seguintes passos:
- Selecionar as colunas que queremos
- Passar essa seleção para variavel nova

In [24]:
df[['rank','category', 'personName', 'age', 'country','source', 'status','gender']].head()

,rank,category,personName,age,country,source,status,gender
0,1,Fashion & Retail,Bernard Arnault & family,74.0,France,LVMH,U,M
1,2,Automotive,Elon Musk,51.0,United States,"Tesla, SpaceX",D,M
2,3,Technology,Jeff Bezos,59.0,United States,Amazon,D,M
3,4,Technology,Larry Ellison,78.0,United States,Oracle,U,M
4,5,Finance & Investments,Warren Buffett,92.0,United States,Berkshire Hathaway,D,M